#--1 创建数据库

DROP DATABASE IF EXISTS fn;
CREATE DATABASE fn CHARSET=UTF8;
USE fn;

#--2 创建数据表
#--2-1 管理员信息表
CREATE TABLE  xfn_admin(
    aid INT PRIMARY KEY AUTO_INCREMENT,  #--管理员编号
    aname VARCHAR(32) UNIQUE,  #--管理员用户名
    apwd VARCHAR(64)     #--管理员密码
);
 #--2-2 项目全局设置
CREATE TABLE xfn_settings(
    sd INT PRIMARY KEY AUTO_INCREMENT,   #--编号
    appName VARCHAR(32),    #--引用、店家名称
    apiUrl VARCHAR(64),    #--数据api子系统地址
    AdminUrl VARCHAR(64),  #--管理后台子系统地址
    appUrl VARCHAR(64),    #--顾客app子系统地址
    icp  VARCHAR(64),      #--系统备案号
    copyright  VARCHAR(128)   # --系统版权声明
);
 #--2-3 桌台信息表
CREATE TABLE xfn_table(
    tid  INT PRIMARY KEY AUTO_INCREMENT,   #--桌台编号
    tname VARCHAR(64),    #--桌台昵称
    tpe VARCHAR(16),    #--桌台类型
    stus INT
);
 #--2-4 桌台预定信息表
CREATE TABLE xfn_reservation(
    rid INT PRIMARY KEY AUTO_INCREMENT,   
    contactName VARCHAR(64),
    phone VARCHAR(16),       #--联系电话
    contactTime BIGINT,     # --联系时间
    dinnerTime BIGINT,       #--预约用餐时间
    tableId INT,
    FOREIGN KEY (tableId) REFERENCES xfn_table (tid)   #外键
);
 #--2-5 菜品分类
CREATE TABLE xfn_category(
    cid INT PRIMARY KEY AUTO_INCREMENT,  
    cname  VARCHAR(32)
);
 #--2-6 菜品信息表
CREATE TABLE xfn_dish(
    did INT PRIMARY KEY AUTO_INCREMENT,    #--菜品编号
    title VARCHAR(32),      #--菜品名称
    imgUrl VARCHAR(128),    #--图片地址
    price DECIMAL(6,2),      #--价格
    detail VARCHAR(128),     #--详细描述信息 
    categoryId  INT, 
    FOREIGN KEY (categoryId) REFERENCES xfn_category (cid)   #外键
);
#--2-7 订单表
CREATE TABLE xfn_order(
    oid INT PRIMARY KEY AUTO_INCREMENT,  
    startTime BIGINT,
    endTime BIGINT,   
    customerCount INT,   #用餐人数
    tableId INT,   #桌台编号
    FOREIGN KEY (tableId) REFERENCES xfn_table (tid)   #外键
);
#--2-8  订单详细信息表
CREATE TABLE xfn_order_detail(
    did INT PRIMARY KEY AUTO_INCREMENT,
    dishId INT,   #菜品编号 
    dishCount INT,  #菜品数量
    customerCount VARCHAR(64),   #点餐用户称呼
    orderId INT,
    FOREIGN KEY (dishId) REFERENCES xfn_dish (did),   #外键
    FOREIGN KEY (orderId) REFERENCES xfn_order (oid)  #外键
);
#管理用户插入信息
INSERT INTO xfn_admin VALUES
(null,'SJF',PASSWORD('123')),
(null,'Different',PASSWORD('123')),
(null,'Infinite',PASSWORD('123'));

INSERT INTO  xfn_settings VALUES
(null,'小牛','http://127.0.0.1:8090','http://127.0.0.1:8091','http://127.0.0.1:8092','京ICP备12003709号-3','Copyright © 北京达内金桥科技有限公司版权所有');

INSERT INTO xfn_table VALUES
(null,'福满堂','6-8人桌',1),
(null,'金镶玉','4人桌',2),
(null,'手气天','10人桌',3),
(null,'全家福','2人桌',0);

INSERT INTO xfn_reservation VALUES
(null,'钉钉','18329359979',1548404830402,1548410400000,1),
(null,'丫丫','18329359979',1548404830402,1548410400000,2),
(null,'豆豆','18329359979',1548404830402,1548410400000,3),
(null,'花花','18329359979',1548404830402,1548410400000,4),
(null,'糖糖','18329359979',1548404830402,1548410400000,2);

INSERT INTO xfn_category VALUES
(null,'肉类'),
(null,'丸滑类'),
(null,'海鲜河鲜类'),
(null,'蔬菜豆制品'),
(null,'菌菇类');

INSERT INTO xfn_dish VALUES
(10000,'草鱼片','CE7I9470.jpg',35,'选鲜活草鱼，切出鱼片冷鲜保存。锅开后再煮1分钟左右即可食用。',1),
(null,'脆皮肠','CE7I9017.jpg',28,'锅开后再煮3分钟左右即可食用。',1),
(null,'酥肉','HGS_4760.jpg',30,'选用冷鲜五花肉，加上鸡蛋，淀粉等原料炸制，色泽黄亮，酥软醇香，肥而不腻。锅开后再煮3分钟左右即可食用。',1),
(null,'现炸酥肉(非清真)','HGS_4760-1.jpg',32,'选用冷鲜五花肉，加上鸡蛋，淀粉等原料炸制，色泽黄亮，酥软醇香，肥而不腻。锅开后再煮1分钟左右即可食用，也可直接食用',1),
(null,'牛百叶','CE7I9302.jpg',32,'毛肚切丝后，配以调味料腌制而成。锅开后再煮2分钟左右即可食用。',1),
(null,'腰花','CE7I9287.jpg',32,'选用大型厂家冷鲜腰花，经过解冻、清洗、切片而成。锅开后涮30秒左右即可食用。',1),
(null,'猪脑花','zl.jpg',32,'选用大型厂家冷鲜猪脑经过清洗，过水、撕膜而成。肉质细腻，锅开后再煮8分钟左右即可食用。',1),
(null,'午餐肉','wcr.jpg',32,'锅开后再煮2分钟左右即可食用。',1),
(null,'牛仔骨','1-CE7I5290.jpg',32,'牛仔骨又称牛小排，选自资质合格的厂家生产配送。锅开后再煮5分钟左右即可食用。',1),
(null,'新西兰羊肉卷','CE7I8804_1.jpg',32,'选用新西兰羔羊肉的前胸和肩胛为原料，在国内经过分割、压制成型，肥瘦均匀。锅开后涮30秒左右即可食用。',1),
(null,'捞派黄喉','EU0A01121.jpg',32,'黄喉主要是猪和牛的大血管，以脆爽见长，是四川火锅中的经典菜式。捞派黄喉选用猪黄喉，相比牛黄喉，猪黄喉只有30cm可用，肉质比牛黄喉薄，口感更脆。 捞派黄喉，通过去筋膜、清水浸泡15小时以上，自然去除黄喉的血水和腥味。口感脆嫩弹牙，是川味火锅的经典菜式。',1),
(null,'千层毛肚','CE7I89001.jpg',32,'选自牛的草肚，加入葱、姜、五香料一起煮熟后切片而成。五香味浓、耙软化渣。锅开后再煮3分钟左右即可食用。',1),
(null,'捞派脆脆毛肚','md.jpg',32,'选自牛的草肚，采用流水清洗、撕片等工艺，加入各种调味料腌制而成。口感脆嫩，锅开后再采用“七上八下”的方法涮15秒即可食用。',1),
(null,'捞派嫩羊肉','cyr.jpg',32,'羊后腿肉肉质紧实，肥肉少，以瘦肉为主；肉中夹筋，筋肉相连。肉质相比前腿肉更为细嫩，用途广，一般用于烧烤、酱制等用途。海底捞只选用生长周期达到6—8个月的草原羔羊，肉嫩筋少而膻味少。精选羔羊后腿肉，肉质紧实，瘦而不柴，再用红油腌制入味，肉香与油香充分融合，一口咬下去鲜嫩多汁、肉味十足。',1),
(null,'草原羔羊肉','CE7I6859.jpg',32,'选自内蒙锡林郭勒大草原10月龄以下羔羊，经过排酸、切割、冷冻而成。锅开后涮30秒左右即可食用。',1),
(null,'澳洲肥牛(和牛)','CE7I88713.jpg',32,'百分百澳洲牛肉的前胸部位，口感香嫩，汁浓味厚。锅开后涮30秒即可食用。',1),
(null,'捞派滑牛肉','laopaihuaniurou.jpg',52,'捞派滑牛肉使用的牛肉是大小米龙和嫩肩肉，是牛的后腿和前腿部位，最嫩的部位，形状像黄瓜，俗称：黄瓜条。每份滑牛都要经过解冻、去筋膜、分割、切片、腌制等9道复杂工序，口感滑嫩，久煮不老，是海底捞必点菜品。',1),
(null,'血旺','CE7I6826_1.jpg',52,'选用资质合格的厂家配送。锅开后再煮5分钟左右即可食用。',1),
(null,'捞派肥牛','CE7I69031.jpg',52,'肥牛是经过排酸处理后切成薄片的牛肉。排酸是指通过一定的温度、湿度、风速的环境下使牛的肌肉纤维发生变化，其口感更细腻、化渣。海底捞的捞派肥牛，精选谷饲100天以上的牛，自然块分割，肉味十足，久涮不淡。',1),
(null,'捞派鸭肠','yc7.jpg',52,'火锅三宝之一。鸭肠，具有韧性。口感脆爽有嚼劲，是火锅中经常用到的食材。 捞派鸭肠，选用资质和证件齐全的屠宰场鸭肠。经过掏肠、去大油、结石、抛肠、清洗、刀工去小油、清洗等步骤，确保每根鸭肠无杂物。捞派鸭肠口感自然脆爽，下锅涮食20-25秒左右即可食用。',1),
(null,'捞派毛肚','CE7I6805.jpg',52,'选自牛的草肚，采用流水清洗、撕片等工艺，加入葱姜、料酒、花椒浸泡而成。口感脆嫩，锅开后涮10-15秒即可食用。',1),
(null,'羊排卷','CE7I6926_2.jpg',52,'甄选12月龄以下放牧羔羊，以肥瘦相间的腹肉部位加工而成。口感细嫩化渣，锅开后涮30秒左右即可食用。',1),
(null,'手切羊肉','CE7I8833_1.jpg',52,'甄选12月龄以下羔羊后腿以及羊霖，经过切配、装盘而成。锅开后再煮1分钟左右即可食用。',1),
(null,'火边子牛肉','HGS_60461.jpg',52,'沿用四川自贡盐井的名菜火边子牛肉工艺，主要采用黄瓜条、多种炒香辣椒面、香辛料配制而成。颜色红亮，口味香辣刺激。锅开后再煮4分钟左右即可食用',1),
(null,'捞派精品肥牛','CE7I6861_1.jpg',82,'肥牛是经过排酸处理后切成薄片的牛肉。排酸是指通过一定的温度、湿度、风速的环境下使牛的肌肉纤维发生变化，其口感更细腻、化渣。 海底捞的精品肥牛，精选进口、自然生长谷饲100天以上的牛。每头牛只选用牛背部第1-6根肋骨上脑部位，一头牛产20公斤左右。经过排酸处理后，自然块分割，涮食时不易散，肉味浓，保证牛肉原有的香味。',1),
(null,'羊眼','CE7I5311_.jpg',62,'羊眼经过排酸、切割、冷冻而成。锅开后再煮5分钟左右即可食用。',1),
(null,'猪蹄','CE7I9134_.jpg',62,'猪蹄斩成小块，经过清洗，过水，用十余种符合国家食品安全的食材一起炖煮而成。锅开后再煮5分钟即可食用。',1),
(null,'捞派小鲜肉(非清真)','HGS_5710-.jpg',62,'将上好猪颈肉切片腌制，口感鲜香、脆嫩、爽滑，这就是您的小鲜肉。锅开后再煮3分钟左右即可食用。',1),
(null,'捞派九尺鸭肠','yc6.jpg',52,'选自资质合格的供应商配送的鲜鸭肠。锅开后再“七上八下”涮食15秒即可食用。',1),

(null,'旭伟蟹肉墨鱼滑','CE7I7004.jpg',52,'将冰鲜墨鱼筒，经破碎、搅拌等工艺，再配以秘制调料，嵌入鲜毛蟹中。锅开后再煮4分钟左右即可食用。配上丸滑蘸碟，风味更突出。',2),
(null,'兆湛撒尿牛肉丸','EU0A0225.jpg',102,'选用牛后腿部位牛霖，经过排酸、绞碎、搅打成的牛肉滑，捏成丸子后，里面裹入用老鸡、火腿等精心熬制的汤冻。锅开后浮起来再煮3分钟左右即可食用。配上丸滑蘸碟，风味更突出。撒尿牛丸中心汤汁温度较高，吃时小心被汤汁烫到。',2),
(null,'西式牛肉滑','CE7I9010_2.jpg',102,'选用牛后腿部位，经过排酸、绞碎、搅打而成的牛肉滑，放入香菇、芹菜粒等原料，配以蛋黄。开锅后由服务员搅拌均匀、做成小丸下入，浮起来再煮3分钟左右即可食用。配上丸滑蘸碟，风味更突出。',2),
(null,'丸类组合','1-CE7I8934_1.jpg',102,'由多种丸类组合而成。锅开后浮起来再煮3分钟左右即可食用。配上丸滑蘸碟，风味更突出。',2),
(null,'贝柱滑','CE7I8951_bzh1.jpg',92,'选用海湾贝肉打成滑，加上各种调料手工搅打起胶后再拼回贝壳。锅开后再煮3分钟左右即可食用，配上丸滑蘸碟，风味更突出。',2),
(null,'招牌虾滑','zpxh1.jpg',92,'精选湛江、北海区域出产的南美品种白虾虾仁，配以盐和淀粉等调料制作而成。虾肉含量越高，虾滑口感越纯正。相比纯虾肉，虾滑食用方便、入口爽滑鲜甜Q弹，海底捞独有的定制生产工艺，含肉量虾肉含量93%，出品装盘前手工摔打10次，是火锅中的经典食材。',2),
(null,'精品肉丸','CE7I8988_rw1.jpg',92,'选自资质合格的厂家。锅开后浮起来后再煮3分钟左右即可食用。',2),
(null,'手工墨鱼丸','1-CE7I8920_myw2.jpg',92,'墨鱼经破碎、搅拌等工艺，再配以秘制调料混合而成。锅开后再浮起来再煮3分钟即可食用。配上丸滑蘸碟，风味更突出。',2),

(null,'冻虾','CE7I7004_dx.jpg',52,'将活虾冷冻而成。肉质脆嫩，锅开后再煮4分钟左右即可食用。',3),
(null,'鱼豆腐','CE7I9538_ydf1.jpg',52,'选用优质鱼肉，配以佐料，搅打、蒸制而成。细嫩鲜滑，鱼香味浓。锅开后再煮2分钟左右即可食用。',3),
(null,'活虾','CE7I5749_hx.jpg',52,'选自广东湛江、北海区域南美白虾，清洗干净装盘，锅开后再煮2分钟左右即可食用。',3),
(null,'青斑','CE7I6489_qb.jpg',82,'经过宰杀、去内脏、清洗、装盘而成。锅开后鱼片煮1分钟左右，鱼头、鱼排煮4分钟即可食用。',3),
(null,'花鲢鱼头','CE7I5652_yt.jpg',82,'选鲜活花鲢鱼，取头冷鲜保存。锅开后再煮5分钟左右即可食用。',3),
(null,'鱿鱼须','CE7I9509_yyx1.jpg',82,'选用鱿鱼触角，速冻保鲜。锅开后再煮5分钟左右即可食用',3),
(null,'大闸蟹','CE7I5902_dzx.jpg',92,'大闸蟹是一种经济蟹类，又称河蟹、毛蟹、清水蟹、大闸蟹或螃蟹，顾客可根据情况选择生、熟两种大闸蟹，生的大闸蟹，锅开后再煮8分钟左右即可食用',3),
(null,'蛎蝗','CE7I5772_lh.jpg',92,'经过宰杀、去内脏、清洗、装盘后上桌。锅开后再煮4-5分钟左右即可食用。',3),
(null,'大淡菜','CE7I5887_ddc.jpg',92,'经过宰杀、去内脏、清洗、装盘而成。锅开后再煮4分钟左右即可食用。',3),
(null,'北极贝','CE7I5767_bjb.jpg',92,'北极贝是源自北大西洋冰冷深海的一种贝类，肉质肥美，锅开后再煮4分钟左右即可食用',3),
(null,'带鱼','CE7I5786_dy.jpg',92,'带鱼又叫刀鱼、牙带鱼，其肉厚刺少，锅开后再煮5分钟左右即可食用',3),
(null,'油蛤','CE7I6479_yh.jpg',92,'经过宰杀、去内脏、清洗、装盘而成。锅开后再煮4分钟左右即可食用。',3),
(null,'黑头鱼','CE7I6550_hty.jpg',92,'俗名猪嘴鱼，齿小而鳃耙多且长，门店经过宰杀、去内脏、清洗后装盘上桌，锅开后再煮6分钟左右即可食用。',3),
(null,'油条虾','CE7I5265_ytx.jpg',92,'油条炸制后，裹入虾滑而成。将油条的香味和虾滑的脆嫩结合在一起，锅开后再煮3分钟左右即可食用。',3),
(null,'深水虾','CE7I5838_shx1.jpg',92,'经过挑选、装盘而成。口感鲜嫩、食用方便，锅开后再煮2分钟左右即可食用。',3),
(null,'蟹味棒','CE7I8996_xwb.jpg',92,'锅开后再煮2分钟左右即可食用。',3),
(null,'美国红鱼(时价)','CE7I5742_mghy.jpg',92,'经过宰杀、去内脏、清洗、装盘后上桌。锅开后再煮4-5分钟左右即可食用。',3),
(null,'鱿鱼','CE7I5797_yy.jpg',92,'选自资质合格的厂家，经过速冻保鲜配送。锅开后再煮5分钟左右即可食用',3),
(null,'生蚝','CE7I5816_sh.jpg',92,'经过宰杀、去内脏、清洗、装盘而成。海鲜味浓郁，锅开后再煮1分钟左右即可食用。',3),
(null,'扇贝','CE7I5844_sb.jpg',92,'鲜活扇贝，餐前宰杀后上桌。锅开后再煮4分钟左右即可食用。',3),
(null,'象拔蚌','CE7I5826_xb.jpg',92,'产自广西北海的象拔蚌，宰杀后上桌。锅开后再煮4分钟左右即可食用。',3),
(null,'捞派无刺巴沙鱼','CE7I6948_syp.jpg',92,'巴沙鱼是东南亚淡水鱼品种。越南音译为"卡巴沙"(CABaSa)，意思是"三块脂肪鱼"，因为该鱼在生长过程中，腹腔积累有三块较大的油脂，约占体重的58%。 海底捞选用越南湄公河流域养殖的巴沙鱼。经工厂低温车间宰杀、快速去皮等工艺加工成鱼柳，包装速冻，再通过海底捞中央厨房加工腌制而成。巴沙鱼口味鲜嫩，且无刺无腥味，特别适合老人、小孩食用。',3),
(null,'罗非鱼','lfy-seafood-haidilao.jpg',92,'来自海拔1500米的云南高原深水罗非鱼，沐浴北回归线上的阳光，肉质鲜美嫩滑，余味悠长。',3),
(null,'捞派鱼饼','yb.jpg',92,'采用鱼肉制作，适合老人、孩子、女士，配上海鲜汁，鲜味浓郁，煮4分钟左右即可食用。',3),
(null,'草鱼头','CE7I9443_cyt.jpg',92,'精选鲜活草鱼，取头后冷鲜保存，锅开后再煮5分钟左右即可食用。',3),
(null,'黑鱼片','CE7I6269_hyp2.jpg',92,'鲜活黑鱼取鱼片，调味后摆盘上桌。锅开后再煮1分钟左右即可食用。',3),
(null,'海鲜组合','CE7I6572_hxzhA.jpg',92,'由多种海鲜组合而成。下入锅中，开锅后再煮3分钟即可食用。',3),
(null,'明虾','CE7I5838_mx.jpg',92,'经过清洗、装盘而成。锅开后再煮2分钟左右即可食用。',3),

(null,'包心生菜','bc.jpg',92,'经过挑选、清洗、装盘而成。口感清香，锅开后再煮1分钟左右即可食用',4),
(null,'蒿子秆（皇帝菜）','CE7I9268_gzx1.jpg',92,'经过挑选、清洗、切配、装盘而成，锅开后再煮1分钟左右即可食用',4),
(null,'竹笋','CE7I9228_zs2.jpg',92,'竹笋清洗后对剖切开，装盘，口感脆爽，锅开后再煮4分钟左右即可食用',4),
(null,'土豆','td1.jpg',92,'经过去泥、挑选、去皮、清洗、切配、装盘而成。锅开后再煮4分钟左右即可食用',4),
(null,'山药','sy1.jpg',92,'经过去泥、挑选、去皮、清洗、切配、装盘而成。锅开后再煮3分钟左右即可食用。',4),
(null,'冬瓜','dg1.jpg',92,'经过去泥、挑选、去皮、清洗、切配、装盘而成。锅开后再煮1分钟即可食用，不宜久煮，否则会煮溶',4),
(null,'白萝卜','CE7I9172_blb1.jpg',92,'经过去泥、挑选、去皮、清洗、切配、装盘而成。锅开后再煮3分钟左右即可食用',4),
(null,'红薯','CE7I9056_hs1.jpg',92,'经过去泥、挑选、去皮、清洗、切配、装盘而成。口感香甜，锅开后再煮4分钟左右即可食用',4),
(null,'海带','CE7I9593_hd2.jpg',92,'经过浸泡、挑选、清洗、切配、装盘而成。锅开后再煮3分钟左右即可食用',4),
(null,'白菜','CE7I9259_dbc1.jpg',92,'经过挑选、清洗、切配、装盘而成，锅开后再煮2分钟左右即可食用',4),
(null,'大白菜','CE7I9259_dbc1.jpg',92,'经过挑选、清洗、切配、装盘而成，锅开后再煮2分钟左右即可食用',4),
(null,'小白菜','CE7I6035_xbc.jpg',92,'经过挑选、清洗、切配、装盘而成。锅开后再煮2分钟左右即可食用',4),
(null,'香菜','CE7I5955_xc.jpg',92,'是云南特色产品，装盘上桌即可。锅开后再煮2-3分钟左右即可食用',4),
(null,'茼蒿/蓬蒿菜','CE7I9317_th1.jpg',92,'经过挑选、清洗、装盘而成。锅开后再煮1分钟左右即可食用',4),
(null,'薄荷','CE7I6135_bh.jpg',92,'薄荷，土名叫“银丹草”，为唇形科植物，门店经过清洗后装盘上桌。锅开后再煮1-2分钟左右即可食用',4),
(null,'丝瓜','CE7I5997_sg.jpg',92,'丝瓜清洗、去外皮后，切段摆盘而成。锅开后再煮3分钟左右即可使用',4),
(null,'娃娃菜','CE7I6690_wwc1.jpg',92,'通过挑选、清洗、切配、装盘而成，易吸收锅底汤汁，锅开后再煮2分钟左右即可食用',4),
(null,'菠菜','bc1.jpg',92,'经过挑选、清洗、切配、装盘而成。锅开后再煮1分钟左右即可食用',4),
(null,'豆苗','CE7I9499_dm1.jpg',92,'经过挑选、清洗、装盘而成。口感较脆，锅开后再煮1分钟左右即可食用',4),
(null,'芦笋','ls1.jpg',92,'芦笋清新爽口、味道独特，锅开后煮4分钟即可食用',4),
(null,'油麦菜','CE7I9352_ymc1.jpg',92,'经过挑选、清洗、切配、装盘而成。叶嫩杆脆，锅开后再煮1分钟左右即可食用',4),
(null,'豌豆尖','HGS_6096wdj1.jpg',92,'经过挑选、清洗、装盘而成。茎叶柔嫩，味美可口，锅开后再煮30秒左右即可食用',4),
(null,'散叶生菜','CE7I5535_sysc.jpg',92,'经过挑选、清洗、装盘而成。口感鲜嫩，锅开后再煮1分钟左右即可食用',4),
(null,'莴笋尖/凤尾','CE7I6054_wsj.jpg',92,'经过挑选、清洗、切配、装盘而成。锅开后再煮2分钟即可食用。',4),
(null,'油豆腐皮','HGS_4813ydfp.jpg',92,'切段、装盘，锅开后涮30秒左右即可食用',4),
(null,'炸豆衣','CE7I9203_zdy.jpg',92,'鲜豆皮酿制，豆香味浓郁，锅开后涮30秒左右即可食用。',4),
(null,'青笋','HGS_5023qs2.jpg',92,'经过挑选、清洗、切配、装盘而成。锅开后涮30秒即可食用',4),
(null,'手切笋','sqs-veg-haidilao.jpg',92,'来自福建、安徽、湖北等地大山深处的毛竹笋，具有质嫩、色白、清脆、味甜的特性，竹林都在海拔 300-500 米以上的高山上，没有工业化污染。',4),
(null,'捞派豆花','CE7I8846_dh3.jpg',92,'采用优质大豆磨浆，经传统手工工艺压制而成。锅开后再煮5分钟左右即可食用。配上豆花蘸碟，口味更突出',4),


(null,'青笋','HGS_5023qs1.jpg',92,'经过去泥、挑选、去皮、清洗、切配、装盘而成。口感清脆，锅开后再煮4分钟左右即可食用',5),
(null,'有机香菇','CE7I9428_xg3.jpg',92,'经过挑选、清洗、装盘而成。锅开后再煮2分钟左右即可食用',5),
(null,'杏鲍菇','CE7I6062_xpg.jpg',92,'经过挑选、清洗、切配、装盘而成。锅开后再煮3分钟左右即可食用',5),
(null,'椎茸','CE7I6119_zs.jpg',92,'经过清洗、切配、装盘而成。锅开后再煮4分钟左右即可食用',5),
(null,'木耳','CE7I9160_mr1.jpg',92,'经过浸泡、挑选、装盘而成。锅开后再煮3分钟左右即可食用',5),
(null,'平菇','CE7I9182_pg1.jpg',92,'经过挑选、清洗、装盘而成。脆嫩而肥厚，锅开后再煮5分钟左右即可食用',5),
(null,'竹荪','CE7I9244_zm1.jpg',92,'野生竹荪，口感爽滑、脆嫩，开锅后煮3分钟左右即可食用',5),
(null,'香菇','CE7I9428_xg2.jpg',92,'经过挑选、清洗、切配、装盘而成。锅开后再煮5分钟左右即可食用',5),
(null,'金针菇','CE7I6734_jzg1.jpg',92,'经过挑选、清洗、装盘而成。菌盖滑嫩、清脆，锅开后再煮2分钟左右即可食用。',5);


INSERT INTO xfn_order VALUES
(null,1548406954701,1548406977342,4,1),
(null,1548408873506,1548408884539,6,2),
(null,1548408898471,1548408910640,2,3),
(null,1548408920326,1548408929719,8,1);

INSERT INTO xfn_order_detail VALUES
(null,10000,1,'丁丁',1),
(null,10001,2,'花花',2),
(null,10002,3,'豆豆',3),
(null,10003,4,'丫丫',4);